<HTML><HEAD>   <TITLE>1, rue fra.so | Tutoriel HTML 3.2 - Introduction</TITLE><META NAME="author" CONTENT="fra.so"><META NAME="keywords" CONTENT="art, images, peinture, infographie, sculpture, HTML4, trucs, astuces, graphisme"><META NAME="lang" CONTENT="fr, en, esp"><meta name="description" content="Galerie d'oeuvres artistiques personnelles. Sculpture, peinture et infographie. Vous trouverez aussi un resume de la specification du HTML4 par le W3C ainsi que nos sites favoris"><style type="text/css"><!--a:active {  text-decoration: none; font-family: Arial, Helvetica, sans-serif}a:link {  font-family: Arial, Helvetica, sans-serif; text-decoration: none}a:visited {  font-family: Arial, Helvetica, sans-serif; text-decoration: none}.indenter {  font-family: Arial, Helvetica, sans-serif; text-indent: 1cm; text-align: justify}.nsi {  font-family: Arial, Helvetica, sans-serif; text-align: justify}h1 {  font-family: Arial, Helvetica, sans-serif}h2 {  font-family: Arial, Helvetica, sans-serif}h3 {  font-family: Arial, Helvetica, sans-serif}h4 {  font-family: Arial, Helvetica, sans-serif}h5 {  font-family: Arial, Helvetica, sans-serif}h6 {  font-family: Arial, Helvetica, sans-serif}.blueSample {  font-family: Arial, Helvetica, sans-serif; color: #000099}.greenTitle {  font-family: Arial, Helvetica, sans-serif; color: #006666}.nsic { font-family: Arial, Helvetica, sans-serif; text-align: center}--></style></HEAD><BODY BGCOLOR="#FFFFFF" LINK="#FF3300" ALINK="#FFFFFF" VLINK="#660099"><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH=599><TR>	<TD VALIGN=top WIDTH=139><P>&nbsp;</TD>	<TD VALIGN=top WIDTH=460><p class="nsi"><a href="sommaire.htm">Sommaire</A> - <a href="index.htm">Pr&eacute;c&eacute;dent</a> - <a href="struct.htm">Suivant</a><P>&nbsp;<P>               <H1>Formation au HTML 3.2 : Editer un document HTML</H1><P class="indenter">Il serait sans doute bon que, de temps &agrave; autres, vous fassiez des essais avec les balises que je pr&eacute;sente. Cela vous permettra de vous rendre compte, r&eacute;ellement, de leur effet et de vous familiariser avec leur utilisation. Voici donc la proc&eacute;dure pour &eacute;diter, modifier et v&eacute;rifier un document HTML.<P>&nbsp;<H2>Cr&eacute;er un nouveau document</H2><OL class="nsi"><LI>Pour cr&eacute;er un nouveau document HTML, lancez votre &eacute;diteur de texte et ouvrez un nouveau document (si le logiciel ne le fait pas automatiquement).<LI>La le&ccedil;on "Structure g&eacute;n&eacute;rale d'un document HTML" commence par un exemple de code HTML. S&eacute;lectionnez-le &agrave; la souris dans votre navigateur, copiez-le et collez-le dans votre nouveau document dans votre &eacute;diteur de texte.<LI>Entre les balises &lt;TITLE&gt; et &lt;/TITLE&gt;, remplacez le texte par le titre que vous souhaitez donner &agrave; votre document ("Exercices de HTML", par exemple).<LI>Dans le menu <B>Fichier</B>, choisissez "<B>Enregistrer sous</B>". Choisissez l'endroit o&ugrave; vos souhaitez enregistrer ce fichier (l'id&eacute;al &eacute;tant de cr&eacute;er un dossier ou r&eacute;pertoire o&ugrave; vous regrouperez tout vos fichiers d'exercice HTML). Nommez le fichier en prenant soin de lui ajouter l'extension ".<B>html</B>" ou ".<B>htm</B>". Pour ceux qui utilisent un &eacute;diteur de texte, n'oubliez pas de choisir le format "<B>Texte seulement</B>". Validez.<LI>Retournez dans votre navigateur et ouvrez le fichier que vous venez de cr&eacute;er. Seul le texte "contenu de votre document..." s'affiche.<BR>Cependant, en observant la barre de titre de la fen&ecirc;tre du navigateur, vous pouvez voir que le texte que vous avez entr&eacute; entre les balises &lt;TITLE&gt; et &lt;/TITLE&gt; sert de titre &agrave; votre document (pour les non-anglicistes, "title" signifie titre). Pas mal, non? Et ce n'est qu'un d&eacute;but!</OL><P class="indenter">Plus tard, pour modifier le contenu de votre fichier HTML, il vous suffit de retourner dans l'&eacute;diteur de texte et de le modifier. N'oubliez cependant pas d'enregistrer le fichier avant de le recharger dans votre navigateur.<P>&nbsp;<H2>Charger le fichier dans votre navigateur</H2><P class="indenter">Pour que les modifications apport&eacute;es dans vos fichiers HTML soient prises en compte dans votre navigateur, il vous faut &agrave; chaque fois ouvrir le fichier &agrave; partir du menu <B>Fichier</B>.<BR>Une autre possibilit&eacute; s'offre &agrave; vous : utiliser le bouton "<B>Rafraichir</B>" ou "<B>Recharger</B>" de votre navigateur. J'attire cependant votre attention sur le fait qu'en fonction de la configuration de votre logiciel internet, ce rafraichissement peut se faire &agrave; partir de la version conserv&eacute;e dans la cache. Ainsi, les modifications que vous aurez apport&eacute; &agrave; votre document HTML n'apparaitront pas. Pour y rem&eacute;dier, maintenez la touche "<B>majuscule temporaire</B>" en cliquant sur le bouton de rechargement.<P class="nsi">Vous &ecirc;tes maintenant pr&ecirc;t pour cr&eacute;er vos propres documents HTML.<P>&nbsp;<p class="nsi"><a href="sommaire.htm">Sommaire</A> - <a href="index.htm">Pr&eacute;c&eacute;dent</A> - <a href="struct.htm">Suivant</a><P>&nbsp;</TD></TR></TABLE></BODY></HTML>
