<HTML><HEAD>   <TITLE>1, rue fra.so | Tutoriel HTML 3.2 - Introduction</TITLE><META NAME="author" CONTENT="fra.so"><META NAME="keywords" CONTENT="art, images, peinture, infographie, sculpture, HTML4, trucs, astuces, graphisme"><META NAME="lang" CONTENT="fr, en, esp"><meta name="description" content="Galerie d'oeuvres artistiques personnelles. Sculpture, peinture et infographie. Vous trouverez aussi un resume de la specification du HTML4 par le W3C ainsi que nos sites favoris"><style type="text/css"><!--a:active {  text-decoration: none; font-family: Arial, Helvetica, sans-serif}a:link {  font-family: Arial, Helvetica, sans-serif; text-decoration: none}a:visited {  font-family: Arial, Helvetica, sans-serif; text-decoration: none}.indenter {  font-family: Arial, Helvetica, sans-serif; text-indent: 1cm; text-align: justify}.nsi {  font-family: Arial, Helvetica, sans-serif; text-align: justify}h1 {  font-family: Arial, Helvetica, sans-serif}h2 {  font-family: Arial, Helvetica, sans-serif}h3 {  font-family: Arial, Helvetica, sans-serif}h4 {  font-family: Arial, Helvetica, sans-serif}h5 {  font-family: Arial, Helvetica, sans-serif}h6 {  font-family: Arial, Helvetica, sans-serif}.blueSample {  font-family: Arial, Helvetica, sans-serif; color: #000099}.greenTitle {  font-family: Arial, Helvetica, sans-serif; color: #006666}.nsic { font-family: Arial, Helvetica, sans-serif; text-align: center}--></style></HEAD><BODY BGCOLOR="#FFFFFF" LINK="#FF3300" ALINK="#FFFFFF" VLINK="#660099"><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH=599><TR>	<TD VALIGN=top WIDTH=139><P>&nbsp;</TD>	<TD VALIGN=top WIDTH=460><p class="nsi"><a href="sommaire.htm">Sommaire</A> - <a href="format.htm">Pr&eacute;c&eacute;dent</a> - <a href="liens.htm">Suivant</a><P>&nbsp;<P>               <H1>Formation au HTML 3.2 : Afficher des images</H1><P class="indenter">Ne dit-on pas qu'une image vaut bien mille mots! Eh bien nous allons voir comment afficher des images dans vos pages web.<H2>1- Les formats de fichiers graphiques</H2><P class="nsi">C'est simple, il n'y en a que deux qui soient reconnues universellement : le GIF et le JPG.<BLOCKQUOTE><BLOCKQUOTE><P class="nsi">+ <B>le format GIF</B> : particuli&egrave;rement &agrave; l'aise avec les aplats de couleurs, ce format permet des fichiers de faible encombrement et permet l'entrelacement (affichage progressif par bandes) et la transparence (format GIF89a).<P class="nsi">+ <B>le format JPG</B> : il permet de varier le taux de compression et donc de mieux adapter le rapport poids-qualit&eacute; de l'image. Ce format est recommand&eacute; pour les photos et en g&eacute;n&eacute;ral les images comportant des d&eacute;grad&eacute;s de couleurs.</BLOCKQUOTE></BLOCKQUOTE><P class="nsi">Il &eacute;xiste d'autres formats, mais il faut alors que votre visiteur ait ajout&eacute; &agrave; son navigateur les pluggins n&eacute;cessaires (petits programmes additionnels).<H2>2- Affichage simple d'une image</H2><P class="nsi">Le code de base est des plus simples : <FONT COLOR="#0000AF">&lt;IMG SRC="fichier.gif"&gt;</FONT><P class="nsi">Cet &eacute;l&eacute;ment ne comporte pas de balise de fin.<P class="nsi">Ce code suppose cependant que le fichier image se situe dans le m&ecirc;me dossier que celui du fichier HTML qui y fait appel. Nous allons donc voir comment faire si ce fichier graphique se situe dans un autre dossier.<P class="nsi"><A NAME="chemin">&nbsp;</A><H2>3- Suivre le chemin</H2><P class="indenter">Indiquer au navigateur le chemin &agrave; suivre pour trouver un fichier graphique est sans doute une partie un peu difficile. Mais vous devriez vous en sortir tr&egrave;s bien (j'y arrive bien!). Ce que nous allons voir ici pour les images s'applique aussi aux liens vers d'autres fichiers HTML. Pour des raisons pratiques, disons que le dossier/r&eacute;pertoire s'appelle "<I>images</I>"<BLOCKQUOTE><BLOCKQUOTE><P class="nsi"><B>+ l'image se situe dans le dossier/r&eacute;pertoire du fichier HTML :</B><P class="nsi">c'est le cas le plus simple, celui que nous avons vu dans l'exemple pr&eacute;c&eacute;dent.<P class="nsi"><B>+ l'image se trouve dans un sous-r&eacute;pertoire/dossier situ&eacute; dans le dossier o&ugrave; se situe le fichier HTML :</B><P class="nsi">c'est encore relativement simple, le code est <FONT COLOR="#0000AF">&lt;IMG SRC="images/fichier.gif"&gt;</FONT><P class="nsi">Si le dossier "images" se trouve dans un r&eacute;pertoire qui lui-m&ecirc;me se situe dans le r&eacute;pertoire du fichier HTML, il suffit d'indiquer le chemin complet : <FONT COLOR="#0000AF">&lt;IMG SRC="repertoireX/images/fichier.gif"&gt;</FONT><P class="nsi"><B>+ l'image se situe dans un r&eacute;pertoire/dossier sup&eacute;rieur &agrave; celui du fichier HMTL :</B><P class="nsi">on indique alors simplement au navigateur de "remonter" d'un niveau pour trouver le fichier : <FONT COLOR="#0000AF">&lt;IMG SRC="../fichier.gif"&gt;</FONT><P class="nsi">Si le fichier se situe dans un dossier situ&eacute; &agrave; plusieurs niveaux au-dessus de celui du fichier HTML, on multiplie l'indication pour remonter : <FONT COLOR="#0000AF">&lt;IMG SRC="../../../fichier.gif"&gt;</FONT><P class="nsi">Si le fichier se situe dans "images", situ&eacute; plusieurs niveaux au-dessus du fichier HTML : <FONT COLOR="#0000AF">&lt;IMG SRC="../../../images/fichier.gif"&gt;</FONT></BLOCKQUOTE></BLOCKQUOTE><P class="nsic"><B>Voici quelques exemples illustr&eacute;s de chemins :</B><P class="nsic"><IMG SRC="imgchemins/1.gif" WIDTH=300 HEIGHT=200><BR>&lt;IMG SRC="fichier.gif"&gt;<HR width="40%" height="1" noshade><P class="nsic"><IMG SRC="imgchemins/2.gif" WIDTH=300 HEIGHT=200><BR>&lt;IMG SRC="repertoireX/images/fichier.gif"&gt;<HR width="40%" height="1" noshade><P class="nsic"><IMG SRC="imgchemins/3.gif" WIDTH=300 HEIGHT=200><BR>&lt;IMG SRC="repertoireX/images/fichier.gif"&gt;<HR width="40%" height="1" noshade><P class="nsic"><IMG SRC="imgchemins/4.gif" WIDTH=300 HEIGHT=200><BR>&lt;IMG SRC="../fichier.gif"&gt;<HR width="40%" height="1" noshade><P class="nsic"><IMG SRC="imgchemins/5.gif" WIDTH=300 HEIGHT=200><BR>&lt;IMG SRC="../../../fichier.gif"&gt;<HR width="40%" height="1" noshade><P class="nsic"><IMG SRC="imgchemins/6.gif" WIDTH=300 HEIGHT=200 vspace=10><BR>&lt;IMG SRC="../../images/fichier.gif"&gt;<P>&nbsp;<H2>4- Les attributs de &lt;IMG&gt;</H2><BLOCKQUOTE><BLOCKQUOTE><P class="nsi">+ <FONT COLOR="#0000AF">width=pixels</FONT> - indique la largeur de l'image &agrave; afficher<P class="nsi">+ <FONT COLOR="#0000AF">height=pixels</FONT> - indique la hauteur de l'image &agrave; afficher<P class="nsi">+ <FONT COLOR="#0000AF">alt="texte descriptif"</FONT> - quelques mots qui s'affichent avant le chargement de l'image, ou en cas d'impossibilit&eacute; de charger le fichier<P class="nsi">+ <FONT COLOR="#0000AF">align=left / center / right</FONT> - alignement de l'image sur la page<P class="nsi">+ <FONT COLOR="#0000AF">border=pixel</FONT> - par d&eacute;faut, le navigateur affiche un cadre de 1 pixel d'&eacute;paisseur autour de l'image. 0 signifie qu'il n'y a pas de cadre.<P class="nsi">+ <FONT COLOR="#0000AF">vspace=pixels </FONT>- sp&eacute;cifie un espace vierge en pixels de chaque c&ocirc;t&eacute;s de l'image<P class="nsi">+ <FONT COLOR="#0000AF">hspace=pixels</FONT> - sp&eacute;cifie un espace vierge en pixels en haut et en bas de l'image<P class="nsi">+ <FONT COLOR="#0000AF">lowsrc="fichierbis.jpg"</FONT> - sp&eacute;cifie un fichier en basse r&eacute;solution de l'image &agrave; charger. Si votre fichier graphique est lourd, utiliser cet attribut pour faire patienter vos visiteurs avec une image en basse r&eacute;solution. Cette image doit avoir les m&ecirc;mes dimensions que l'image finale.</BLOCKQUOTE></BLOCKQUOTE><P class="nsi">Voici un exemple de code reprenant tous ces attributs :<P class="nsi"><FONT COLOR="#0000AF">&lt;IMG SRC="Nantes.gif" lowsrc="Nantesbis.jpg" height="125" width="125" alt="Ma ville" border="0" align=center vspace=10 hspace=10&gt;</FONT><P class="indenter">Ce code affiche une image situ&eacute;e dans le m&ecirc;me fichier HTML qui l'appelle. Pendant son chargement, il affiche le texte "Ma ville", puis l'image en basse r&eacute;solution "Nantesbis.jpg". Sa taille est de 125 x 125 et elle est align&eacute;e au centre. Elle ne poss&egrave;de pas de bordure et un espace de 10 pixels l'entoure compl&egrave;tement.<H2>5- Une image pour le fond de votre page</H2><P class="indenter">Nous le verrons plus tard, vous pouvez sp&eacute;cifier la couleur du fond de votre page, celle du texte, et des liens visit&eacute;s. Mais nous allons voir maintenant comment charger une image comme fond de page. Le navigateur r&eacute;p&egrave;te cette image pour "remplir" enti&egrave;rement le fond de la fen&ecirc;tre ouverte.<BR>Un conseil, prenez un fichier tr&egrave;s l&eacute;ger et dont les motifs ne nuiront pas &agrave; la lecture de vos documents.<P class="nsi">Il s'agit en fait d'un attribut de la balise de d&eacute;but <FONT COLOR="#0000AF">&lt;BODY&gt; : &lt;BODY background="fichier.jpg"&gt;</FONT><P class="nsi">N'oubliez pas de fournir le chemin du fichier si celui-ci ne se trouve pas dans le m&ecirc;me dossier/r&eacute;pertoire que le fichier HTML.<P>&nbsp;<p class="nsi"><a href="sommaire.htm">Sommaire</A> - <a href="format.htm">Pr&eacute;c&eacute;dent</A> - <a href="liens.htm">Suivant</a><P>&nbsp;</TD></TR></TABLE></BODY></HTML>
