<HEAD>   <TITLE>1, rue fra.so | Tutoriel HTML 3.2 - Introduction</TITLE><META NAME="author" CONTENT="fra.so"><META NAME="keywords" CONTENT="art, images, peinture, infographie, sculpture, HTML4, trucs, astuces, graphisme"><META NAME="lang" CONTENT="fr, en, esp"><meta name="description" content="Galerie d'oeuvres artistiques personnelles. Sculpture, peinture et infographie. Vous trouverez aussi un resume de la specification du HTML4 par le W3C ainsi que nos sites favoris"><style type="text/css"><!--a:active {  text-decoration: none; font-family: Arial, Helvetica, sans-serif}a:link {  font-family: Arial, Helvetica, sans-serif; text-decoration: none}a:visited {  font-family: Arial, Helvetica, sans-serif; text-decoration: none}.indenter {  font-family: Arial, Helvetica, sans-serif; text-indent: 1cm; text-align: justify}.nsi {  font-family: Arial, Helvetica, sans-serif; text-align: justify}h1 {  font-family: Arial, Helvetica, sans-serif}h2 {  font-family: Arial, Helvetica, sans-serif}h3 {  font-family: Arial, Helvetica, sans-serif}h4 {  font-family: Arial, Helvetica, sans-serif}h5 {  font-family: Arial, Helvetica, sans-serif}h6 {  font-family: Arial, Helvetica, sans-serif}.blueSample {  font-family: Arial, Helvetica, sans-serif; color: #000099}.greenTitle {  font-family: Arial, Helvetica, sans-serif; color: #006666}.nsic { font-family: Arial, Helvetica, sans-serif; text-align: center}--></style></HEAD><BODY BGCOLOR="#FFFFFF" LINK="#FF3300" ALINK="#FFFFFF" VLINK="#660099"><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH=599><TR>	<TD VALIGN=top WIDTH=139><P>&nbsp;</TD>	<TD VALIGN=top WIDTH=460><p class="nsi"><a href="sommaire.htm">Sommaire</A> - <a href="editer.htm">Suivant</a><P>&nbsp;<P>               <H1>Formation au HTML 3.2 : Introduction</H1><H2>Pourquoi ce tutoriel?</H2><P class="indenter">Ce tutoriel a pour but de vous fournir les cl&eacute;s du HTML 3.2, voire un peu plus. M&ecirc;me si vous utilisez un logiciel qui se charge de g&eacute;n&eacute;rer ce code, des connaissances en HTML peuvent s'av&eacute;rer fort utiles lorsque les choses ne fonctionnent pas comme pr&eacute;vu.<P class="indenter">Vous pouvez, dans un souci de confort et d'&eacute;conomie pour votre facture t&eacute;l&eacute;phonique, <a href="../download.html">t&eacute;l&eacute;charger</a> la version compl&egrave;te de ce tutoriel.<P class="indenter">J'ai volontairement choisi la version 3.2 du HTML car elle me parait plus abordable pour l'apprentissage, et c'est surtout la version la plus largement comprise par les navigateurs aujourd'hui.<P class="nsi">Je vous propose de commencer par quelques points importants.<P>&nbsp;<H2>Trousse &agrave; outils</H2><P class="indenter">Vous le savez sans doute, il &eacute;xiste beaucoup de logiciels de publication pour Internet qui se chargent, avec plus ou moins de r&eacute;ussite, de g&eacute;n&eacute;rer le code HTML. N&eacute;anmoins, l'avantage de conna&icirc;tre le HTML est que l'on peut se passer de ces logiciels et ainsi &eacute;pargner son compte en banque.<P class="indenter">Si la plate-forme informatique que vous utilisez n'a gu&egrave;re d'importance (Mac ou PC), il vous faut cependant une "trousse &agrave; outils" minimum. Beaucoup de ces outils sont inclus dans votre syst&egrave;me (MacOs ou Windows) ou sont disponibles en freeware (gratuits) ou en shareware (vous pouvez essayer le produit avant de l'acheter, mais n'oubliez pas de retribuer son auteur si vous continuez &agrave; utiliser son logiciel). Voici ce que je vous conseille d'utiliser pour ce tutoriel (vous &ecirc;tes cependant libre de choisir d'autre logiciels) :<H3><U>Pour &eacute;diter vos fichiers HTML :</U></H3><P class="indenter">Un simple &eacute;diteur de texte suffit : SimpleText, Wordpad ou Write.<BR>C'est la solution la plus simple et celle qui vous permettra de v&eacute;rifier l'effet de chaque balise et/ou attribut que je pr&eacute;sente.<P class="nsi">N.B. : Pour ceux qui tiennent &agrave; utiliser un traitement de texte du style Microsoft Word, il est tr&egrave;s important de choisir le format "<B>Texte seulement</B>" au moment d'enregistrer vos fichiers.<H3><U>Pour g&eacute;rer vos images :</U></H3><P class="indenter">Des logiciels en shareware tels que Graphic Converter (Mac) ou Paint Shop Pro (PC) font tout &agrave; fait l'affaire, pour une somme tr&egrave;s raisonnable.<H3><U>Codes h&eacute;xad&eacute;cimaux des couleurs :</U></H3><P class="indenter">Il &eacute;xiste des logiciels en freeware qui permettent d'obtenir le code h&eacute;xad&eacute;cimal d'une couleur en la s&eacute;lectionnant simplement dans une palette. En surfant sur le web, vous trouverez ce qui vous conviendra.<P>&nbsp;<H2>Nommer vos fichiers HTML</H2><P class="indenter">Le nom que vous donnez &agrave; vos fichiers HTML est libre, si ce n'est qu'il est limit&eacute; &agrave; 8 caract&egrave;res sous DOS et Windows 3.x. J'attire seulement votre attention sur la notion de casse, c'est-&agrave;-dire le respect des majuscules et minuscules.<P class="indenter">En effet, lorsque vous vous trouvez sous syst&egrave;me utilisateur (MacOs ou Windows), le fait que vous fassiez appel &agrave; un fichier nomm&eacute; "Bonjour.html" par "bonjour.html" ne pose a priori pas de probl&egrave;me. Tant que vous &ecirc;tes sous syst&egrave;me utilisateur.<BR>Mais sur Internet, la plupart des serveurs - l&agrave; o&ugrave; seront stock&eacute;es vos pages personnelles - fonctionnent sous UNIX ou d&eacute;riv&eacute;. Or Unix est sensible &agrave; la casse, c'est-&agrave;-dire que si vous appelez le fichier "Bonjour.html" en tapant "bonjour.html", vous n'obtiendrez pas de r&eacute;ponse, ou un message d'erreur. Sous Unix, il s'agit de deux fichiers distincts.<P class="indenter">En guise de conseil, essayez de n'utiliser que des minuscules dans vos noms de fichier (ou que des majuscules), ce qui vous permettra d'&eacute;viter ce risque d'erreur.<P>&nbsp;<H2>L'extension des fichiers HTML</H2><P class="indenter">Lorsque vous enregistrez vos fichiers HTML, il faut leur donner une extension, m&ecirc;me si vous travaillez sous MacOs ou Windows 9x! Cette extension est "<B>.html</B>", ou "<B>.htm</B>" si vous travaillez sous DOS ou Windows 3.x.<P>&nbsp;<H2>R&egrave;gle g&eacute;n&eacute;rale sur les balises HTML</H2><P class="indenter">Les balises HTML fonctionnent par paire : une balise d'ouverture, &lt;TITLE&gt;, et une balise de fermeture, &lt;/TITLE&gt;. Comme vous pouvez le voir dans cet exemple (nous en verrons le sens plus tard), le nom de la balise est encadr&eacute; par les signes "<B>&lt;</B>" et "<B>&gt;</B>". Cela permet au navigateur de diff&eacute;rencier le contenu du document du code qui sert &agrave; le mettre en forme. La balise de fin reprende le nom de la balise de d&eacute;but mais contient en plus un slash "<B>/</B>", ce qui indique que l'application de la balise cesse &agrave; cet endroit.<P class="nsi">Comme toute r&egrave;gle, nous verrons par la suite qu'il &eacute;xiste un certain nombre d'exceptions (absence de balise de fin notamment).<P>&nbsp;<H2>D&eacute;finition et Conventions</H2><P class="indenter">Le langage HTML est un ensemble de codes ou de balises qui permettent de formater, d'afficher et de pr&eacute;senter vos donn&eacute;es en vue de leur publication sur Internet.<P class="indenter">Chaque balise HTML peut recevoir des attributs qui permettent d'afiner ou de modifier le fonctionnement de la balise. Pour vous permettre de les diff&eacute;rencier, j'&eacute;crirai les balises en <B>MAJUSCULES</B> et les attributs en <B>minuscules</B>. Je parle d'<B>&eacute;l&eacute;ment</B> pour d&eacute;finir les balises de d&eacute;but et de fin.<P class="nsi">N.B. : Lorsque vous saisissez votre code HTML, sachez que ce langage est insensible &agrave; la casse, en d'autres termes, vous pouvez tapez vos balises et attributs en majuscules ou minuscules.<P>&nbsp;<H2>Comment proc&eacute;der?</H2><P class="indenter">Dans les le&ccedil;ons qui suivent, je vous pr&eacute;sente les principales balises du HTML 3.2 et leurs attributs. Je donne quelques exemples de codes, mais qui restent insuffisants pour vous montrer les petits diff&eacute;rences qui &eacute;xistent parfois.<P class="indenter">Aussi je vous conseille de lire chaque le&ccedil;on dans son int&eacute;gralit&eacute;, puis de faire des essais par vous-m&ecirc;me. Dans beaucoup de cas, le fait de cr&eacute;er le code vous-m&ecirc;me vous &eacute;clairera sur l'utilit&eacute; des balises et attributs.<P>&nbsp;<p class="nsi"><a href="sommaire.htm">Sommaire</A> - <a href="editer.htm">Suivant</a><P>&nbsp;</TD></TR></TABLE></BODY></HTML>
