<HTML><HEAD>   <TITLE>1, rue fra.so | Tutoriel HTML 3.2 - Les Liens Hypertextes</TITLE><META NAME="author" CONTENT="fra.so"><META NAME="keywords" CONTENT="art, images, peinture, infographie, sculpture, HTML4, trucs, astuces, graphisme"><META NAME="lang" CONTENT="fr, en, esp"><meta name="description" content="Galerie d'oeuvres artistiques personnelles. Sculpture, peinture et infographie. Vous trouverez aussi un resume de la specification du HTML4 par le W3C ainsi que nos sites favoris"><style type="text/css"><!--a:active {  text-decoration: none; font-family: Arial, Helvetica, sans-serif}a:link {  font-family: Arial, Helvetica, sans-serif; text-decoration: none}a:visited {  font-family: Arial, Helvetica, sans-serif; text-decoration: none}.indenter {  font-family: Arial, Helvetica, sans-serif; text-indent: 1cm; text-align: justify}.nsi {  font-family: Arial, Helvetica, sans-serif; text-align: justify}h1 {  font-family: Arial, Helvetica, sans-serif}h2 {  font-family: Arial, Helvetica, sans-serif}h3 {  font-family: Arial, Helvetica, sans-serif}h4 {  font-family: Arial, Helvetica, sans-serif}h5 {  font-family: Arial, Helvetica, sans-serif}h6 {  font-family: Arial, Helvetica, sans-serif}.blueSample {  font-family: Arial, Helvetica, sans-serif; color: #000099}.greenTitle {  font-family: Arial, Helvetica, sans-serif; color: #006666}.nsic { font-family: Arial, Helvetica, sans-serif; text-align: center}--></style></HEAD><BODY BGCOLOR="#FFFFFF" LINK="#FF3300" ALINK="#FFFFFF" VLINK="#660099"><TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 WIDTH=599><TR>	<TD VALIGN=top WIDTH=139><P>&nbsp;</TD>	<TD VALIGN=top WIDTH=460><p class="nsi"><a href="sommaire.htm">Sommaire</A> - <a href="images.htm">Pr&eacute;c&eacute;dent</a> - <a href="listes.htm">Suivant</a><P>&nbsp;<P>               <H1>Formation au HTML 3.2 : Les Liens HyperTextes</H1><P class="indenter">Vous savez maintenant mettre en forme votre texte pour l'afficher sur Internet. Vous savez comment afficher vos images. Mais toute la puissance d'Internet r&eacute;side sans doute dans sa facult&eacute; &agrave; relier les sites et les documents entre eux, gr&acirc;ce aux liens hypertextes. Et, cerise sur le g&acirc;teau, ce n'est pas plus difficile que ce que nous avons vu jusqu'&agrave; pr&eacute;sent.<P class="nsi">Note : je pars du principe que vous &ecirc;tes familier de la notion de "chemin" et que vous savez comment indiquer au navigateur l'itin&eacute;raire &agrave; suivre pour trouver un fichier. Pour un petit rappel, relisez la section concernant le sujet dans la le&ccedil;on pr&eacute;c&eacute;dente "<A HREF="images.htm#chemin">Afficher des images</A>".<H2>1- Cr&eacute;er un lien hypertexte - &lt;A&gt;</H2><P class="indenter">Un lien HTML poss&egrave;de toujours deux extr&eacute;mit&eacute;s : le d&eacute;but (le pointeur, ou le lien) et la fin (la cible).<P class="indenter">Le d&eacute;but correspond au texte (ou image) qui pointe vers un autre &eacute;l&eacute;ment. Souvent, il s'agit du texte soulign&eacute; et de couleur diff&eacute;rente au-dessus duquel le curseur de la souris se transforme. Pour une image, si celle-ci ne poss&egrave;de pas de cadre, seule le changement de forme du curseur indique qu'il s'agit d'un lien.<P class="indenter">La fin d'un lien est le fichier qui s'affiche lorsque le lien a &eacute;t&eacute; cliqu&eacute;. Il peut s'agir d'un fichier HTML, d'une partie du m&ecirc;me fichier (voir la section suivante sur les ancres), d'une image, de vid&eacute;o ou de son. Ce document peut se trouver sur le m&ecirc;me site (on utilise alors une adresse relative. Ex : ../images/fichier.html) ou sur un autre site (on utilise alors une adresse absolue. Ex. : http://www.monsite.com/fichier.html).<P class="indenter">La mise en oeuvre d'un lien hypertexte est tr&egrave;s simple : <FONT COLOR="#0000AF">&lt;AHREF="adresse_document_vis&eacute;.html"&gt;</FONT>Lien hypertexte<FONT COLOR="#0000AF">&lt;/A&gt;</FONT><P class="nsi">Il vous suffit d'indiquer l'adresse (relative ou absolue) du fichier qui devra se charger quand le texte sera cliqu&eacute;.<H2>2- Utiliser les ancres - &lt;A name="..."&gt;</H2><P class="indenter">Gr&acirc;ce aux ancres, il est possible de sp&eacute;cifier une section de texte, &agrave; l'int&eacute;rieur d'un document HTML, qui devra &ecirc;tre affich&eacute;e. Pour &ecirc;tre plus clair, imaginons que nous ayons un document contenant des po&eacute;sies, dont l'une des sections, disons la partie 2, concerne les oeuvres de Baudelaire. Si dans un sommaire nous faisons r&eacute;f&eacute;rence &agrave; cette partie, au milieu de beaucoup d'autres. Nos visiteurs, int&eacute;r&eacute;ss&eacute;s particuli&egrave;rement par Baudelaire et non par les autres, pourrait gr&acirc;ce &agrave; un lien aller directement &agrave; cette partie. Il nous faut pour cela construire :<UL class="nsi"><LI>dans le document contenant les po&eacute;sies, un marqueur invisible identifiant la partie concernant Baudelaire :<UL class="nsi"><B>Ins&eacute;rer une ancre</B><LI>A l'endroit que vous souhaitez identifier, placez la balise suivante : <FONT COLOR="#0000AF">&lt;A name="partie2"&gt;</FONT>II- La po&eacute;sie de Baudelaire<FONT COLOR="#0000AF">&lt;/A&gt;</FONT><LI>Le nom que vous donnez &agrave; une ancre doit &ecirc;tre unique &agrave; l'int&eacute;rieur d'un m&ecirc;me document HTML.</UL><LI>dans le sommaire, un lien pointant vers le fichier, et plus pr&eacute;cisement, &agrave; l'int&eacute;rieur de ce fichier, vers l'ancre identifiant cette partie.<UL><B>Pointer vers une ancre</B><LI>Lorsque vous construisez votre lien vers le fichier poesie.html (c'est un exemple!), il vous suffit d'ajouter le nom de l'ancre &agrave; la suite du nom du fichier. Comme suit : <FONT COLOR="#0000AF">&lt;A HREF="poesie.html#partie2"&gt;</FONT>Baudelaire et le Mal de Vivre<FONT COLOR="#0000AF">&lt;/A&gt;</FONT><LI><B>N'oubliez surtout pas le signe di&egrave;se (#) entre le nom de fichier et celui de l'ancre, car c'est lui qui indique au navigateur de chercher l'ancre "partie2" dans le fichier "poesie.html".</B></UL></UL><P class="indenter">Vous pouvez aussi faire r&eacute;f&eacute;rence &agrave; une ancre situ&eacute;e dans un m&ecirc;me fichier : <FONTCOLOR="#0000AF">&lt;A HREF="#partie2"&gt;</FONT>Baudelaire<FONT COLOR="#0000AF">&lt;/A&gt;</FONT><P>&nbsp;<P class="indenter">Voil&agrave;. Vous pouvez d&eacute;sormais relier vos documents entre eux. Faites des essais, le plus dur &eacute;tant d'&ecirc;tre tr&egrave;s rigoureux dans le chemin que l'on fournit.<P>&nbsp;<p class="nsi"><a href="sommaire.htm">Sommaire</A> - <a href="images.htm">Pr&eacute;c&eacute;dent</A> - <a href="listes.htm">Suivant</a><P>&nbsp;</TD></TR></TABLE></BODY></HTML>
